<?php

     $dataname=array("รายงานรายได้ประจำวัน",
        "รานงานสกุลเงินที่ขายดีที่สุดประจำวัน",
        "รานงานสกุลเงินที่ขายได้น้อยที่สุดประจำวัน",
        "รายงานรายได้ประจำเดือน",
        "รานงานสกุลเงินที่ขายดีที่สุดประจำเดือน",
        "รานงานสกุลเงินที่ขายได้น้อยที่สุดประจำเดือน",
        "รานงานสกุลเงินที่ขายดีที่สุดประจำปี",
        "รานงานสกุลเงินที่ขายได้น้อยที่สุดประจำปี",
        "รายงานค่า Rate ประจำวัน",
        "รายงานค่า Rate ประจำเดือน",
        "รายงานค่า Rate ประจำปี",
        "รายงานผู้แลกเงินบ่อยที่สุดประจำเดือน",
        "อันดับผู้แลกเงินบ่อยที่สุดประจำปี",
        "รายงานพนักงานประจำเดือน",
        "รายงานพนักงานประจำปี");
     $data=array("form1.php","form2.php","form3.php","form4.php","form5.php","form6.php","form7.php","form8.php","form9.php","form10.php","form11.php");
    for ($i = 0; $i < count($dataname); $i++) {
        if($_POST['select']==$dataname[$i])
            echo "<script type='text/javascript'>window.location.href ='$data[$i]'</script>";   
        
}
?>